#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/lhtran/aws_ec2_gatewise/runs/run-6KyP4YciX8CJeCCg

Waiting for the plan to start...

Terraform v1.3.1
on linux_amd64
Initializing plugins and modules...
data.aws_vpcs.selected: Reading...
data.aws_route53_zone.selected: Reading...
data.aws_ami.gatewise_ami: Reading...
data.aws_vpcs.selected: Read complete after 0s [id=us-east-1]
data.aws_security_groups.default: Reading...
data.aws_security_groups.web: Reading...
data.aws_security_groups.my_ip: Reading...
data.aws_subnets.selected_public: Reading...
data.aws_ami.gatewise_ami: Read complete after 0s [id=ami-06f2e4ad33302007c]
data.aws_security_groups.default: Read complete after 0s [id=us-east-1]
data.aws_security_groups.web: Read complete after 0s [id=us-east-1]
data.aws_security_groups.my_ip: Read complete after 0s [id=us-east-1]
data.aws_subnets.selected_public: Read complete after 0s [id=us-east-1]
data.aws_route53_zone.selected: Read complete after 1s [id=Z022583428QVEZLG6VHU3]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.gatewise will be created
  + resource "aws_route53_record" "gatewise" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gatewiseb"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z022583428QVEZLG6VHU3"
    }

  # module.gatewise_ec2.aws_instance.this[0] will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-06f2e4ad33302007c"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t4g.nano"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "lhtran-core-keypair"
      + monitoring                           = false
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-02b9356e386bc7f1e"
      + tags                                 = {
          + "Name" = "awspl-app-gatewise-testpr"
          + "app"  = "gatewise"
          + "env"  = "production"
        }
      + tags_all                             = {
          + "Name" = "awspl-app-gatewise-testpr"
          + "app"  = "gatewise"
          + "env"  = "production"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + volume_tags                          = {
          + "Name" = "awspl-app-gatewise-testpr"
          + "app"  = "gatewise"
          + "env"  = "production"
        }
      + vpc_security_group_ids               = [
          + "sg-052154b1777a1e617",
          + "sg-06e61dfb1a827ff3f",
          + "sg-0708f519948077307",
          + "sg-070bc706a4f597cea",
          + "sg-08b0aaca98fdf9343",
          + "sg-0fbb2ad2975672830",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + credit_specification {}

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "optional"
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + timeouts {}
    }

Plan: 2 to add, 0 to change, 0 to destroy.


```

</details>

*Pushed by: @longhtran91, Action: `pull_request`*